// Задача №1
// Що потрапить в консоль

let someVar = 0;
++someVar;

if (someVar) {
	console.log(someVar);
}

Відповідь: someVar = 1

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

Відповідь
for(let i=1; i<=10;  i++){
console.log(`Пункт №${i}`);
}


// Задача №3
// Що потрапить в консоль 
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}

// Відповідь
// 2 * 20 = 40 <= 10 (false) OR 30 / 2 = 15 < 5(false) AND 10 <= "10" (true) OR 20 === "20"(false)
// false || false && (|| has higher priority then &&) true || false
// false || false|| false
// Result: 000 !== false
// Нічого не буде в консолі

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку 

Відповідь
function divving_show(a = 1, b = 1) {
    let result = a / b;
    if (b === 0) {
        console.log('Помилка: Некоректні аргументи для ділення');
    } else if (!isFinite(result)) {
        console.log('Помилка: Ділення веде до нескінченності або нечислового результату');
    } else {
         console.log(`Результат ділення: ${result}`);
    }
}
divving_show();
divving_show(3, 0);
divving_show(0, 3);
divving_show(0, 0);
divving_show(-5);
divving_show('a', 2);
divving_show(10, 5);
divving_show(5, 10);
divving_show(-5, 5);



// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

Відповідь
let arr = ['a', 10, "10", `10`, -7];
arr.forEach((element) => {
    if (element === 10)
    console.log(element);
});


